{
    "id": "graduation",
    "story": [
        "Weighing all my options, I had decided in the mid of 2012 to pursue my graduation from Visvesvaraya National Institute of Technology (VNIT), Nagpur. During the process of making these life changing decisions and applying for desired colleges / streams for graduation, I always knew I’d be getting out of the college  with a B. Tech. degree and hopefully in four years. But I never realized I was going to spend this time building thousands of memories that I could later cherish.",
        "First year, we’d registered and started with the lectures. From day one, A lot of things started pouring down on us. All seemed very different around here, in the college. In the backdrop of regular classes, practical and exams, we had to find our feet, make new friends among complete strangers, adjust to the food in the mess, the culture and traditions of the place, add to that settling in an entirely new atmosphere outside of our home, without a safety net. Plus, the rules and restrictions we had to follow as ‘FRESHERS’. For instance, we had to be back in our hostels by 8 p.m., lights out by 10. But with time, we’d found our ways around all of them. I remember breaking out of the hostel at midnight and walking around ten kilometers just to grab a snack. Like this and more other things, we’d started to settle in.",
        "Exams, they were the toughest times in the four years of college. I have always hated theory and hadn’t found my interests in coding yet. Plus, I had gotten myself involved into enough activities, a few in college and  a lot more in Make A Difference organization. This gave me enough excuses apart from laziness to postpone studying. In addition, attendance was also not compulsory in our department. So I had no notes. Well luckily, I’d befriended a studious fellow classmate. And thanks to the Xerox place and my friend’s grace, I could at least get the notes at the last minute. I always had a record late start to preparing for exams. And I only broke my own earlier benchmarks moving forward, most of the times, starting to study at the night just before the exams. Samosas and tarri-poha at the night canteen called chandu’s helped me a lot in the process of studying up late, the exam night. I even remember studying until the professor snatched the books and asked us to settle in the exam room. All this but I could still manage to just keep my head above the water and not get a re-exam.",
        "Our college age old traditions / rituals is what made it really stand apart. Be it about cultural nights, college gatherings and festival celebrations or simply the way we did these things at VNIT. For example, we had an adoption policy in place where seniors ‘tech-adopted’ juniors and made a family outside of home. We even had our own catch phrases to describe our emotions. The funky rally, the rose day at the department gathering or the ‘rath yatra’; the institutional gathering and it’s scoring even for audience’s participation, all these were our own little inventions. ‘Bum-pe-lat’ on birthdays and placement treats. I admit we didn’t have our way of doing everything. But that didn’t make anything any less memorable. Our college had students coming from across the country. This made even the IPL matches in the T.V. room a delight to watch. And so, we learnt and celebrated all cultures.",
        "The final year was an emotional year, especially the last semester. The college campus had turned into our home by now. We’d followed the traditions and culture of this place for too long. We had made friends among strangers. We now knew our ways around things here. We’d learnt to extrapolate answers in the viva. We’d found our favorite places to eat in the city. We’d even gotten our first job here. We’d learnt to live by ourselves. We’d planned for a Goa trip for the third time by now. We’d learnt to run t.v. series and movie marathons and have night outs. We’d built the best memories in this place. Some of us had found our real passion here. And now, we had to leave this place and head in different directions and we weren’t even sure when we might meet next. The last few months after the placements, we’d spent tripling and remembering all the good times and sharing our goodbyes.",
        "These four years, they have made a huge impact on me. And with almost all certainty, I can say that my college stories are as good as any stories can get. Graduating at VNIT had never been just about education and degree, but also about all the other things. Well, I guess the best you’ve ever had is just a memory and those dreams."
    ]
}