{
    "id": "mad",
    "story": [
        "Make a Difference (M.A.D.) is a national level non-governmental organization that strives to ensure equitable outcomes to children at shelter homes. It has projects for academic and personality development in 23 cities across the country and an enthusiastic bunch of volunteers in thousands total. Various activities are also conducted in the community to bring awareness about education and welfare of the kids at shelter homes.",
        "During my graduation, I had a routine of a morning walk with one of my friends in the college. It was during one of our walks that my friend told me about this organization that she’d interviewed for volunteering. I had time to spare then and this seemed like an interesting opportunity for me too. I thought of it as something that I could give to the society. I got interviewed and selected for the role of an English Teacher at one of the shelter homes.",
        "As a teacher, I had to commit about four hours every weekend. I thought this would be just another piece of ‘work’ that I’d have to do. But this commitment turned nothing liked I’d imagined. Rather, it became a fun chore that I started waiting for throughout the week. Being with the kids lightened up my routine. The children had an amazing level of energy which could cheer anyone up. I also realized I loved teaching. And within no time, the volunteers at our shelter home mingled and the job turned into fun with friends. Various city level volunteer engagement activities were also organized by the city core team. Planning for the class, attending M.A.D. city level events, eating out at Shabana’s bakery with fellow volunteers etc. became a part of my week now. This thing that started as a four hour job had later expanded to occupy greater parts of my week. Slowly, my daily routine had begun to revolve around these activities.",
        "The tenure of this teaching commitment ended with the academic year in 2014. It had become clearer to me that I wanted to continue the volunteer work. I decided to apply for a role in the city core team. I spent the following two years serving as the finance and the operations fellow respectively. Basically the roles required me to handle some parts of the work of the city’s operations at the shelters. The following two years began each with a 3-day Leadership Conference where all the cities’ core team members gathered and various leadership sessions were held by the national team. Our leadership skills took shape in these conferences. In the remaining part of the years, we (city’s core team) met more than a few times every week, brainstorming ideas,  conducting sessions, preparing budgets, buying collaterals, planning volunteer recruitment or even engagement activities and center operations, preparing charts, discussing volunteer issues and possible fixes, sometimes just hanging out talking about our lives. Learning to do all this more than 5 hours a day, sometimes more than 5 days a week, with a team that consisted of people with varied perspectives and brilliant enthusiasm is exactly why I mean it when I say I took back a lot more than what I’d put in, in the organization. With the amount of time the team spent together, it had become a second family to me.",
        "A typical year at MAD looked very diverse. Different parts of the year brought different work for the team with it. Volunteer recruitments and Operation planning and preparations for the year happened at the start. Volunteer engagement and operations monitoring were an ongoing process. A 3-4 day outdoor activity for the kids which we called the Dream Camp used to be planned somewhere in the mid of the year. Fundraising events and PR collaborations were distributed throughout the year. A few more activities were also on the calendar.",
        "Working through the entire year with the team, we had our share of challenges. Hours of hard work, planning and monetary costs went inside every activity. And sometimes, these efforts brought less than ideal outcomes. Sometimes, we were simply faced with tough situations. It was a disappointment to see all the physical and financial resources not being able to bring optimum results. Also, as every team does, we had our differences. But in the process, one important aspect of working in a team, I realized was, it was never me vs them, it was always, the team, vs the problem. Moreover fighting through all these problems only made us stronger as a team. It made us a better leader. In the majority of these tough situations, we came out successful, the other times, we learnt a lesson.",
        "Summarizing, I had my ups and downs in my experience of volunteering. But every day, I learnt a lot. Every day, I got to turn into a better version of myself. And I made a lot of friends in the process. I encourage everyone to volunteer for a cause at least once. It isn’t just about giving back to the society, but also the lessons that it teaches you in the process."
    ]
}