{
    "id": "website",
    "story": [
        "A personal website is a set of World Wide Web pages containing information of personal nature. A person’s experience, hobbies, about, blogs, photos all accessible to anyone across the world at the click of a button. It possesses the power to paint a picture of the person. It is a brilliant tool to express yourself. It can generate collaboration opportunities, get business (if it’s a business website), or maybe just build a personal brand, stretching beyond geography constraints. You get all that with some code, a few bucks to buy the domain and some more to host it on the server. That’s it. Having a personal website, I always believed, is way too good an opportunity to be missed out on.",
        "But the task of building the website was not going to be an easy one for me. Technologies used to build a website were a black box to me, which accepted processed data from a magical land called middleware and output that very data into user-friendly beautiful layouts. Basically, this meant unknown hours of lectures to understand the technology behind it. I always hated theory.  Plus, I already had a job which took most of my time. The work involved challenges that used to get me interested enough to read for solutions even outside of work hours. I had a fun team at work that liked to party a lot. Add to it, laziness and hangout plans with friends. Also, I had recently started searching a job for more challenging opportunities. All this and a few more things made it a daunting task.",
        "When I started reading and exploring frontend technologies, I did not have a plan to use it. I never knew I’d be using it to make my own website. I just wanted to spend a fair share of my time learning something. Fronted seemed like the most unknown place to me. Hence, I decided to start with that. Four to five times. That’s how many times I started out with the lengthy lecture series on how to make a website only to leave the learning incomplete. The first time, it appeared all rocket science to me and I was later over-burdened with office work. The next time, it seemed boring reading the same things again only to understand nothing. The next few times were the same story. With time, I was gradually picking up but it was not good enough. ",
        "Curiosity emerged the winner at last. I realized this a little late but code contains infinite capabilities. And I am amazed by that fact. Sure, learning anything has some boring patches but the process is enlightening as a whole. And reaching the end and knowing that you know it now is a wonderful feeling. Talking about my struggle to learn frontend, I realized with time that learning this theory required a project by the side to keep me interested. A generic project to showcase food recipes or the one that contains tic-tac-toe would not have helped. It needed to be connected to me and my interests. That’s when it hit me to build a website of my own. The website could contain my software development work, my interests, even some of my content-writing work that I used to write then and some more things.",
        "That’s how I landed up building a personal website. Once I decided to create this as a project, the learning process fastened it’s course. I could now easily find hours in my day to work on it unlike before. Since I was working on a practical project (one that was to go live), it brought with it a sense of added confidence on my ability to code in frontend. This was all going well to serve the purpose to learn something new. I never thought of the benefits of a personal website initially. It was only later that I realized all the pros that it would bring to me. The activity which was nothing initially, with time, shaped up to being a personal website. And that, is the story of how I got to coding my own website, which gave me a stage to showcase an unfiltered version of me on the internet.",
        "I'd say the best source to learn about building a website with AngularJS framework is the Angular - Tour of Heroes tutorial. Plus the framework has precise and easily understable documentation along with examples. You can also go through some video tutorials available on Udemy but it isn't essential. Before starting with this, do get a basic understanding of HTML / CSS / Javascript."
    ]
}